#+NAME: Equiv
#+AUTHOR: Johann Rosain

*** Equality decidability is closed under equivalences
We show that if =A= and =B= are equivalent, then =A= has decidable equality iff =B= has decidable equality.
#+begin_src ctt
  has-decidable-equality/is-equiv (A B : U) (f : A -> B) (e : is-equiv A B f) (dB : has-decidable-equality B) : has-decidable-equality A =
    \ x y.
      let eq-A : U = (Path A x y)
          eq-B : U = (Path B (f x) (f y)) 
          g : B -> A = is-equiv/inv-map A B f e
          p : Path (A -> A) (\ z. g (f z)) (id A) = eq-htpy A (\ _. A) (\ z. g (f z)) (id A) (is-equiv/inv-left-htpy A B f e)
          h : Path B (f x) (f y) -> Path A x y = \ q. (tr (A -> A) (\ z. g (f z)) (id A) p (\ i. Path A (i x) (i y)) (ap B A g (f x) (f y) q))
      in
      Coprod/map eq-B (neg eq-B) eq-A (neg eq-A) h
                      (\ i q. i (ap A B f x y q)) (dB (f x) (f y))

  has-decidable-equality/is-equiv' (A B : U) (f : A -> B) (e : is-equiv A B f) (dA : has-decidable-equality A) : has-decidable-equality B =
    has-decidable-equality/is-equiv B A (is-equiv/inv-map A B f e) (is-equiv/inv-is-equiv A B f e) dA

  has-decidable-equality/Equiv (A B : U) (e : Equiv A B) (dB : has-decidable-equality B) : has-decidable-equality A =
    has-decidable-equality/is-equiv A B (Equiv/map A B e) (Equiv/is-equiv A B e) dB

  has-decidable-equality/Equiv' (A B : U) (e : Equiv A B) (dA : has-decidable-equality A) : has-decidable-equality B =
    has-decidable-equality/is-equiv' A B (Equiv/map A B e) (Equiv/is-equiv A B e) dA
#+end_src

#+RESULTS:
: Typecheck has succeeded.

*** \Sigma fib is A
    #+begin_src ctt
  equiv-total-fib/map (A B : U) (f : A -> B) (t : Sg B (Fib A B f)) : A = t.2.1

  equiv-total-fib/inv-map (A B : U) (f : A -> B) (x : A) : Sg B (Fib A B f) = (f x, (x, refl B (f x)))

  equiv-total-fib/right-htpy (A B : U) (f : A -> B) : Htpy' A A (\ z. (equiv-total-fib/map A B f) (equiv-total-fib/inv-map A B f z)) (id A) =
    \ x. refl A x

  equiv-total-fib/left-htpy/refl (A B : U) (f : A -> B) (x : A) 
                                       : Path (Sg B (Fib A B f)) ((equiv-total-fib/inv-map A B f) (equiv-total-fib/map A B f (f x, (x, inv B (f x) (f x) (refl B (f x))))))
                                              (f x, (x, inv B (f x) (f x) (refl B (f x)))) =
    ap (Path B (f x) (f x)) (Sg B (Fib A B f)) (\ p. (f x, (x, p))) (refl B (f x)) (inv B (f x) (f x) (refl B (f x))) (refl/sym B (f x))

  equiv-total-fib/left-htpy' (A B : U) (f : A -> B) (y : B) (x : A) (p : Path B (f x) y)
                                  : Path (Sg B (Fib A B f)) ((equiv-total-fib/inv-map A B f) (equiv-total-fib/map A B f (y, (x, inv B (f x) y p)))) (y, (x, inv B (f x) y p)) =
    J B (f x) (\ z q. Path (Sg B (Fib A B f)) ((equiv-total-fib/inv-map A B f) (equiv-total-fib/map A B f (z, (x, inv B (f x) z q)))) (z, (x, inv B (f x) z q)))
              (equiv-total-fib/left-htpy/refl A B f x) y p

  equiv-total-fib/left-htpy (A B : U) (f : A -> B)
                                 : Htpy' (Sg B (Fib A B f)) (Sg B (Fib A B f))
                                         (\ z. (equiv-total-fib/inv-map A B f) (equiv-total-fib/map A B f z)) (id (Sg B (Fib A B f))) =
    \ u.
      let x : A = u.2.1
          y : B = u.1
          p : Path B y (f x) = u.2.2
      in comp-n (Sg B (Fib A B f)) three-Nat ((equiv-total-fib/inv-map A B f) (equiv-total-fib/map A B f (y, (x, p))))
          ((equiv-total-fib/inv-map A B f) (equiv-total-fib/map A B f (y, (x, inv B (f x) y (inv B y (f x) p)))))
          (ap (Path B y (f x)) (Sg B (Fib A B f)) (\ q. (equiv-total-fib/inv-map A B f) (equiv-total-fib/map A B f (y, (x, q)))) p (inv B (f x) y (inv B y (f x) p))
              (inv/involutive' B y (f x) p))
          (y, (x, inv B (f x) y (inv B y (f x) p))) (equiv-total-fib/left-htpy' A B f y x (inv B y (f x) p))
          (y, (x, p)) (ap (Path B y (f x)) (Sg B (Fib A B f)) (\ q. (y, (x, q))) (inv B (f x) y (inv B y (f x) p)) p (inv/involutive B y (f x) p))

  equiv-total-fib/Equiv (A B : U) (f : A -> B) : Equiv (Sg B (Fib A B f)) A =
    has-inverse/Equiv (Sg B (Fib A B f)) A (equiv-total-fib/map A B f)
      (equiv-total-fib/inv-map A B f, (equiv-total-fib/right-htpy A B f, equiv-total-fib/left-htpy A B f))
    #+end_src

#+RESULTS:
: Typecheck has succeeded.

*** A \times B and A' \times B
If A is equivalent to C and B is equivalent to D, then A \times B is equivalent to C \times D.
#+begin_src ctt
  Equiv/prod/map (A A' B : U) (e : Equiv A A') : (A * B) -> (A' * B) =
    \ t. (Equiv/map A A' e t.1, t.2)

  Equiv/prod/inv-map (A A' B : U) (e : Equiv A A') : (A' * B) -> (A * B) =
    \ t. (Equiv/inv-map A A' e t.1, t.2)

  Equiv/prod/right-htpy/sg (A A' B : U) (e : Equiv A A') (x : A') (y : B)
                                : Path (A' * B) (Equiv/prod/map A A' B e (Equiv/prod/inv-map A A' B e (x, y))) (x, y) =
    Eq-prod/eq A' B
      ( Equiv/prod/map A A' B e (Equiv/prod/inv-map A A' B e (x, y)))
      ( x, y)
      ( Equiv/inv-right-htpy A A' e x,
        refl B y)

  Equiv/prod/right-htpy (A A' B : U) (e : Equiv A A') (t : A' * B)
                                : Path (A' * B) (Equiv/prod/map A A' B e (Equiv/prod/inv-map A A' B e t)) t =
    Equiv/prod/right-htpy/sg A A' B e t.1 t.2

  Equiv/prod/left-htpy/sg (A A' B : U) (e : Equiv A A') (x : A) (y : B)
                                  : Path (A * B) (Equiv/prod/inv-map A A' B e (Equiv/prod/map A A' B e (x, y))) (x, y) =
    Eq-prod/eq A B
      ( Equiv/prod/inv-map A A' B e (Equiv/prod/map A A' B e (x, y)))
      ( x, y)
      ( Equiv/inv-left-htpy A A' e x,
        refl B y)

  Equiv/prod/left-htpy (A A' B : U) (e : Equiv A A') (t : A * B)
                               : Path (A * B) (Equiv/prod/inv-map A A' B e (Equiv/prod/map A A' B e t)) t =
    Equiv/prod/left-htpy/sg A A' B e t.1 t.2

  Equiv/prod/is-equiv (A A' B : U) (e : Equiv A A') : is-equiv (A * B) (A' * B) (Equiv/prod/map A A' B e) =
    has-inverse/is-equiv
      ( A * B)
      ( A' * B)
      ( Equiv/prod/map A A' B e)
      ( Equiv/prod/inv-map A A' B e,
        ( Equiv/prod/right-htpy A A' B e,
          Equiv/prod/left-htpy A A' B e))

  Equiv/prod (A A' B : U) (e : Equiv A A') : Equiv (A * B) (A' * B) =
    ( Equiv/prod/map A A' B e,
      Equiv/prod/is-equiv A A' B e)
#+end_src

#+RESULTS:
: Typecheck has succeeded.

*** A \times B and A \times B'
If A is equivalent to C and B is equivalent to D, then A \times B is equivalent to C \times D.
#+begin_src ctt
  Equiv/prod'/map (A B B' : U) (e : Equiv B B') : (A * B) -> (A * B') =
    \ t. (t.1, Equiv/map B B' e t.2)

  Equiv/prod'/inv-map (A B B' : U) (e : Equiv B B') : (A * B') -> (A * B) =
    \ t. (t.1, Equiv/inv-map B B' e t.2)

  Equiv/prod'/right-htpy/sg (A B B' : U) (e : Equiv B B') (x : A) (y : B')
                                 : Path (A * B') (Equiv/prod'/map A B B' e (Equiv/prod'/inv-map A B B' e (x, y))) (x, y) =
    Eq-prod/eq A B'
      ( Equiv/prod'/map A B B' e (Equiv/prod'/inv-map A B B' e (x, y)))
      ( x, y)
      ( refl A x,
        Equiv/inv-right-htpy B B' e y)

  Equiv/prod'/right-htpy (A B B' : U) (e : Equiv B B') (t : A * B')
                                 : Path (A * B') (Equiv/prod'/map A B B' e (Equiv/prod'/inv-map A B B' e t)) t =
    Equiv/prod'/right-htpy/sg A B B' e t.1 t.2

  Equiv/prod'/left-htpy/sg (A B B' : U) (e : Equiv B B') (x : A) (y : B)
                                  : Path (A * B) (Equiv/prod'/inv-map A B B' e (Equiv/prod'/map A B B' e (x, y))) (x, y) =
    Eq-prod/eq A B
      ( Equiv/prod'/inv-map A B B' e (Equiv/prod'/map A B B' e (x, y)))
      ( x, y)
      ( refl A x,
        Equiv/inv-left-htpy B B' e y)

  Equiv/prod'/left-htpy (A B B' : U) (e : Equiv B B') (t : A * B)
                                : Path (A * B) (Equiv/prod'/inv-map A B B' e (Equiv/prod'/map A B B' e t)) t =
    Equiv/prod'/left-htpy/sg A B B' e t.1 t.2

  Equiv/prod'/is-equiv (A B B' : U) (e : Equiv B B') : is-equiv (A * B) (A * B') (Equiv/prod'/map A B B' e) =
    has-inverse/is-equiv
      ( A * B)
      ( A * B')
      ( Equiv/prod'/map A B B' e)
      ( Equiv/prod'/inv-map A B B' e,
        ( Equiv/prod'/right-htpy A B B' e,
          Equiv/prod'/left-htpy A B B' e))

  Equiv/prod' (A B B' : U) (e : Equiv B B') : Equiv (A * B) (A * B') =
    ( Equiv/prod'/map A B B' e,
      Equiv/prod'/is-equiv A B B' e)
#+end_src

#+RESULTS:
: Typecheck has succeeded.

*** \Pi_{x:A}B x and \Pi_{x: A'}B(e(x)) whenever A is equivalent to A'
    #+begin_src ctt
  Equiv/dependent/map (A B : U) (P : B -> U) (e : Equiv A B) : ((y : B) -> P y) -> (x : A) -> P (Equiv/map A B e x) =
    \ h x. h (Equiv/map A B e x)

  Equiv/dependent/inv-map (A B : U) (P : B -> U) (e : Equiv A B) : ((x : A) -> P (Equiv/map A B e x)) -> (y : B) -> P y =
    \ h y. tr B
      ( Equiv/map A B e (Equiv/inv-map A B e y)) y
      ( htpy/half-adjoint/htpy A B
        ( Equiv/map A B e)
        ( Equiv/inv-map A B e)
        ( Equiv/inv-right-htpy A B e)
        ( Equiv/inv-left-htpy A B e) y) P
      ( h (Equiv/inv-map A B e y))

  Equiv/dependent/right-htpy (A B : U) (P : B -> U) (e : Equiv A B) (h : (x : A) -> P (Equiv/map A B e x)) 
                                  : Path ((x : A) -> P (Equiv/map A B e x))
                                         (Equiv/dependent/map A B P e (Equiv/dependent/inv-map A B P e h)) h =
    let f : A -> B = Equiv/map A B e
        g : B -> A = Equiv/inv-map A B e
        G : Htpy' B B (\ x. f (g x)) (id B) = Equiv/inv-right-htpy A B e
        H : Htpy' A A (\ x. g (f x)) (id A) = Equiv/inv-left-htpy A B e
        G' : Htpy' B B (\ y. f (g y)) (id B) = htpy/half-adjoint/htpy A B f g G H
    in
    eq-htpy A
      ( \ x. P (f x))
      ( Equiv/dependent/map A B P e (Equiv/dependent/inv-map A B P e h)) h
      ( \ x. comp-n 
          ( P (f x)) three-Nat
          ( tr B (f (g (f x))) (f x) (G' (f x)) P (h (g (f x))))
          ( tr B (f (g (f x))) (f x) (ap A B f (g (f x)) x (H x)) P (h (g (f x))))
          ( ap (Path B (f (g (f x))) (f x)) (P (f x)) (\ p. tr B (f (g (f x))) (f x) p P (h (g (f x)))) (G' (f x)) (ap A B f (g (f x)) x (H x))
            ( htpy/half-adjoint' A B f g G H x))
          ( tr A (g (f x)) x (H x) (\ z. P (f z)) (h (g (f x))))
          ( tr/ap A B f P (g (f x)) x (H x) (h (g (f x))))
          ( h x)
          ( apd A
            ( \ z. P (f z)) h
            ( g (f x)) x
            ( H x)))

  Equiv/dependent/left-htpy (A B : U) (P : B -> U) (e : Equiv A B) (h : (y : B) -> P y)
                                   : Path ((y : B) -> P y)
                                          (Equiv/dependent/inv-map A B P e (Equiv/dependent/map A B P e h)) h =
    let f : A -> B = Equiv/map A B e
        g : B -> A = Equiv/inv-map A B e
        G : Htpy' B B (\ x. f (g x)) (id B) = Equiv/inv-right-htpy A B e
        H : Htpy' A A (\ x. g (f x)) (id A) = Equiv/inv-left-htpy A B e
        G' : Htpy' B B (\ y. f (g y)) (id B) = htpy/half-adjoint/htpy A B f g G H
    in
    eq-htpy B P
      ( Equiv/dependent/inv-map A B P e (Equiv/dependent/map A B P e h)) h
      ( \ y. apd B P h
            ( f (g y)) y
            ( G' y))

  Equiv/dependent (A B : U) (P : B -> U) (e : Equiv A B)
                       : Equiv ((y : B) -> P y) ((x : A) -> P (Equiv/map A B e x)) =
    has-inverse/Equiv
      ( (y : B) -> P y)
      ( (x : A) -> P (Equiv/map A B e x))
      ( Equiv/dependent/map A B P e)
      ( Equiv/dependent/inv-map A B P e,
        ( Equiv/dependent/right-htpy A B P e,
          Equiv/dependent/left-htpy A B P e))
    #+end_src

#+RESULTS:
: Typecheck has succeeded.

*** \Pi_{x: Unit}B x and B star
    #+begin_src ctt
  Equiv/pi-Unit/map (B : Unit -> U) : ((u : Unit) -> B u) -> B star =
    \ f. f star

  Equiv/pi-Unit/inv-map (B : Unit -> U) (b : B star) : (u : Unit) -> B u = split
    star -> b

  Equiv/pi-Unit/right-htpy (B : Unit -> U) (b : B star) : Path (B star) (Equiv/pi-Unit/map B (Equiv/pi-Unit/inv-map B b)) b =
    refl (B star) b

  Equiv/pi-Unit/left-htpy/star (B : Unit -> U) (f : (u : Unit) -> B u) : (u : Unit) -> Path (B u) (Equiv/pi-Unit/inv-map B (Equiv/pi-Unit/map B f) u) (f u) = split
    star -> refl (B star) (f star)

  Equiv/pi-Unit/left-htpy (B : Unit -> U) (f : (u : Unit) -> B u) : Path ((u : Unit) -> B u) (Equiv/pi-Unit/inv-map B (Equiv/pi-Unit/map B f)) f =
    eq-htpy Unit B
      ( Equiv/pi-Unit/inv-map B (Equiv/pi-Unit/map B f)) f
      ( Equiv/pi-Unit/left-htpy/star B f)

  Equiv/pi-Unit/is-equiv (B : Unit -> U) : is-equiv ((u : Unit) -> B u) (B star) (Equiv/pi-Unit/map B) =
    has-inverse/is-equiv
      ( (u : Unit) -> B u)
      ( B star)
      ( Equiv/pi-Unit/map B)
      ( Equiv/pi-Unit/inv-map B,
        ( Equiv/pi-Unit/right-htpy B,
          Equiv/pi-Unit/left-htpy B))

  Equiv/pi-Unit (B : Unit -> U) : Equiv ((u : Unit) -> B u) (B star) =
    ( Equiv/pi-Unit/map B,
      Equiv/pi-Unit/is-equiv B)
    #+end_src

#+RESULTS:
: Typecheck has succeeded.

*** (x, y) = (x', y') is \Sigma_{p: x = x'}tr_B(p, y) = y'
This result is more or less direct from the one in the prelude.
#+begin_src ctt
  PathSg/Equiv (A : U) (B : A -> U) (u v : Sg A B) : Equiv (Path (Sg A B) u v) (SgPathO A B u v) =
    path-to-equiv
      ( Path (Sg A B) u v)
      ( SgPathO A B u v)
      ( PathSg-eq-SgPathO A B u v)

  PathSg/Equiv' (A : U) (B : A -> U) (u v : Sg A B) : Equiv (SgPathO A B u v) (Path (Sg A B) u v) =
    Equiv/sym
      ( Path (Sg A B) u v)
      ( SgPathO A B u v)
      ( PathSg/Equiv A B u v)
#+end_src

#+RESULTS:
: Typecheck has succeeded.


** Closure of truncation levels under equivalence

If =B= is of level =k= and =A= is equivalent to =B=, then =A= is also of level =k=.
   #+begin_src ctt
  is-of-lvl/closed-equiv (A B : U) (e : Equiv A B) : (k : Nat) -> (H : is-of-lvl k B) -> is-of-lvl k A = split
    zero -> \ H. is-contr/is-contr-equiv A B e H
    suc k ->
      let f : A -> B = Equiv/map A B e in
      \ H x y. is-of-lvl/closed-equiv (Path A x y) (Path B (f x) (f y)) (Equiv/Equiv-id A B e x y) k (H (f x) (f y))

  is-of-lvl/closed-equiv' (A B : U) (e : Equiv A B) (k : Nat) (H : is-of-lvl k A) : is-of-lvl k B =
    is-of-lvl/closed-equiv B A (Equiv/sym A B e) k H
   #+end_src

#+RESULTS:
: Typecheck has succeeded.
** Double inverse of equivalence

   #+begin_src ctt
  lock has-inverse/is-equiv

  Equiv/sym/sym (A B : U) (e : Equiv A B)
                     : Path (Equiv A B) (Equiv/inv-equiv B A (Equiv/inv-equiv A B e)) e =
    SgPath-prop
      ( A -> B)
      ( is-equiv A B)
      ( is-equiv/is-prop A B)
      ( Equiv/inv-equiv B A (Equiv/inv-equiv A B e)) e
      ( eq-htpy' A B
          ( Equiv/map A B
            ( Equiv/inv-equiv B A
              ( Equiv/inv-equiv A B e)))
          ( Equiv/map A B e)
          ( \ x.
              let e' : Equiv B A = Equiv/inv-equiv A B e
                  e'' : Equiv A B = Equiv/inv-equiv B A e'
                  f : A -> B = Equiv/map A B e
                  f' : B -> A = Equiv/map B A e'
                  f'' : A -> B = Equiv/map A B e''
              in
              comp B
                ( f'' x)
                ( f'' (f' (f x)))
                ( ap A B f'' x
                  ( f' (f x))
                  ( inv A
                    ( f' (f x)) x
                    ( Equiv/inv-left-htpy A B e x)))
                ( f x)
                ( Equiv/inv-left-htpy B A e' (f x))))


  Equiv/sym/sym' (A B : U) (e : Equiv A B)
                     : Path (Equiv A B) e (Equiv/inv-equiv B A (Equiv/inv-equiv A B e)) =
    inv
      ( Equiv A B)
      ( Equiv/inv-equiv B A
        ( Equiv/inv-equiv A B e)) e
      ( Equiv/sym/sym A B e)

  unlock has-inverse/is-equiv  
   #+end_src
#+RESULTS:
: Typecheck has succeeded.

